In [1]:
import pandas as pd
import csv
import sqlite3

In [2]:
df1=pd.read_csv("C:/Users/samsa/OneDrive/Masaüstü/NPOWER/exercises/ChicagoCensusData.csv")
df2=pd.read_csv("C:/Users/samsa/OneDrive/Masaüstü/NPOWER/exercises/ChicagoCrimeData.csv")
df3=pd.read_csv("C:/Users/samsa/OneDrive/Masaüstü/NPOWER/exercises/ChicagoPublicSchools.csv")

In [3]:
connection=sqlite3.connect('C:/Users/samsa/OneDrive/Masaüstü/NPOWER/exercises/db2.db')

In [4]:
df1.to_sql(
    name= 'CENSUS_DATA',
    con=connection,
    if_exists ='replace',
    index=False,
    dtype={'COMMUNITY_AREA_NUMBER':'real',
           'COMMUNITY_AREA_NAME':'text',
           'PERCENT_OF_HOUSING_CROWDED':'real',
           'PERCENT_HOUSEHOLDS_BELOW_POVERTY':'real',
           'PERCENT_AGED_16__UNEMPLOYED':'real',
           'PERCENT_AGED_25__WITHOUT_HIGH_SCHOOL_DIPLOMA':'real',
           'PERCENT_AGED_UNDER_18_OR_OVER_64':'real',
           'PER_CAPITA_INCOME':'real',
           'HARDSHIP_INDEX':'real'          
          }
)

In [5]:
df2.to_sql(
    name= 'CHICAGO_CRIME_DATA',
    con=connection,
    if_exists ='replace',
    index=False,
    dtype={'ID':'real',
           'CASE_NUMBER':'text',
           'DATE':'real',
           'BLOCK':'text',
           'IUCR':'real',
           'PRIMARY_TYPE':'text',
           'DESCRIPTION':'text',
           'LOCATION_DESCRIPTION':'text',
           'ARREST':'text', 
            'DOMESTIC':'text',  
            'BEAT':'real',  
            'DISTRICT':'real',  
            'WARD':'real',  
            'COMMUNITY_AREA_NUMBER':'real',  
            'FBICODE':'real',  
            'X_COORDINATE':'real',  
            'Y_COORDINATE':'real',  
            'YEAR':'real',  
            'LATITUDE':'real',  
            'LONGITUDE':'real',  
            'LOCATION':'text'  
          }
)

In [6]:
df3.to_sql(
    name= 'CHICAGO_PUBLIC_SCHOOLS',
    con=connection,
    if_exists ='replace',
    index=False,
    dtype={'School_ID':'real',
           'NAME_OF_SCHOOL':'text',
           'Elementary, Middle, or High School':'text',
           'Street_Address':'text',
           'City':'text',
           'State':'text',
           'ZIP_Code':'real',
           'Phone_Number':'real',
           'Link':'text', 
            'Network_Manager':'text',  
            'Collaborative_Name':'text',  
            'Adequate_Yearly_Progress_Made_':'text',  
            'Track_Schedule':'text',  
            'CPS_Performance_Policy_Status':'text',  
            'CPS_Performance_Policy_Level':'text', 
            'HEALTHY_SCHOOL_CERTIFIED':'text',
            'Safety_Icon':'text',
            'SAFETY_SCORE':'real',
            'Family_Involvement_Icon':'text',
            'Family_Involvement_Score':'real',
            'Environment_Icon':'text',
            'Environment_Score':'real',
            'Instruction_Icon':'text',
            'Instruction_Score':'real',
            'Leaders_Icon':'text',
            'Leaders_Score':'real',
            'Teachers_Icon':'text',
            'Teachers_Score':'real',
            'Parent_Engagement_Icon':'text',
            'Parent_Engagement_Score':'real',
            'Parent_Environment_Icon':'text',
            'Parent_Environment_Score':'real',
            'AVERAGE_STUDENT_ATTENDANCE':'real',
            'Rate_of_Misconducts__per_100_students_':'real',
            'Average_Teacher_Attendance':'real',
            'Individualized_Education_Program_Compliance_Rate':'real',
            'Pk_2_Literacy__':'real',
            'Pk_2_Math__':'real',
            'Gr3_5_Grade_Level_Math__':'real',
            'Gr3_5_Grade_Level_Read__':'real',
            'Gr3_5_Keep_Pace_Read__':'real',
            'Gr3_5_Keep_Pace_Math__':'real',
            'Gr6_8_Grade_Level_Math__':'real',
            'Gr6_8_Grade_Level_Read__':'real',
            'Gr6_8_Keep_Pace_Math_':'real',
            'Gr6_8_Keep_Pace_Read__':'real',
            'Gr_8_Explore_Math__':'real',
            'Gr_8_Explore_Read__':'real',
            'ISAT_Exceeding_Math__':'real',
            'ISAT_Exceeding_Reading__':'real',
            'ISAT_Value_Add_Math':'real',
            'ISAT_Value_Add_Read':'real',
            'ISAT_Value_Add_Color_Math':'text',
            'ISAT_Value_Add_Color_Read':'text',
            'Students_Taking__Algebra__':'real',
            'Students_Passing__Algebra__':'real',
            '9th Grade EXPLORE (2009)':'text',
            '9th Grade EXPLORE (2010)':'text',
            '10th Grade PLAN (2009)':'text',
            '10th Grade PLAN (2010)':'text',
            'Net_Change_EXPLORE_and_PLAN':'text',
            '11th Grade Average ACT (2011)':'text',
            'Net_Change_PLAN_and_ACT':'text',
            'College_Eligibility__':'text',
            'Graduation_Rate__':'text',
            'College_Enrollment_Rate__':'text',
            'COLLEGE_ENROLLMENT':'real',
            'General_Services_Route':'text',
            'Freshman_on_Track_Rate__':'text',
            'X_COORDINATE':'real',
            'Y_COORDINATE':'real',
            'Latitude':'real',
            'Longitude':'real',
            'COMMUNITY_AREA_NUMBER':'real',
            'COMMUNITY_AREA_NAME':'text',
            'Ward':'real',
            'Police_District':'real',
            'Location':'text'
            
          }
)

C:\Users\samsa\anaconda3\lib\site-packages\pandas\core\generic.py:2872: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

In [ ]:
connection.commit()
connection.close()

In [37]:
df=pd.read_sql_query("SELECT * FROM 'CENSUS_DATA' ",connection)

In [45]:
df.head()

,COMMUNITY_AREA_NUMBER,COMMUNITY_AREA_NAME,PERCENT_OF_HOUSING_CROWDED,PERCENT_HOUSEHOLDS_BELOW_POVERTY,PERCENT_AGED_16__UNEMPLOYED,PERCENT_AGED_25__WITHOUT_HIGH_SCHOOL_DIPLOMA,PERCENT_AGED_UNDER_18_OR_OVER_64,PER_CAPITA_INCOME,HARDSHIP_INDEX
0,1.0,Rogers Park,7.7,23.6,8.7,18.2,27.5,23939.0,39.0
1,2.0,West Ridge,7.8,17.2,8.8,20.8,38.5,23040.0,46.0
2,3.0,Uptown,3.8,24.0,8.9,11.8,22.2,35787.0,20.0
3,4.0,Lincoln Square,3.4,10.9,8.2,13.4,25.5,37524.0,17.0
4,5.0,North Center,0.3,7.5,5.2,4.5,26.2,57123.0,6.0

# Problem 1: Find the total number of crimes recorded in the CRIME table.

In [49]:
pd.read_sql_query("SELECT count(distinct ID) as Count from CHICAGO_CRIME_DATA",connection)

   Count
0    533

# Problem 2: List community areas with per capita income less than 11000.

In [50]:

pd.read_sql_query("SELECT community_area_name from census_data where per_capita_income<11000",connection)

  COMMUNITY_AREA_NAME
0  West Garfield Park
1      South Lawndale
2         Fuller Park
3           Riverdale

# Problem 3: List all case numbers for crimes  involving minors?(children are not considered minors for the purposes of crime analysis)

In [60]:

pd.read_sql_query("SELECT case_number from chicago_crime_data where (primary_type)='offense involving children' or (description) like '%minor'",connection)

  CASE_NUMBER
0    HL266884
1    HK238408

# Problem 4: List all kidnapping crimes involving a child?

In [61]:
 pd.read_sql_query("SELECT case_number from chicago_crime_data where primary_type='KIDNAPPING'",connection)

  CASE_NUMBER
0    HN144152

# Problem 5: What kind of crimes were recorded at schools?

In [62]:

pd.read_sql_query("SELECT primary_type as crime_recorded_atschool from  CHICAGO_CRIME_DATA where location_description like '%SCHOOL%'",connection)

   crime_recorded_atschool
0                  BATTERY
1                  BATTERY
2                  BATTERY
3                  BATTERY
4                  BATTERY
5          CRIMINAL DAMAGE
6                NARCOTICS
7                NARCOTICS
8                  ASSAULT
9        CRIMINAL TRESPASS
10  PUBLIC PEACE VIOLATION
11  PUBLIC PEACE VIOLATION

# Problem 6: List the average safety score for all types of schools.

In [63]:
pd.read_sql_query("SELECT avg(safety_score) as average_safety_score from CHICAGO_PUBLIC_SCHOOLS",connection)

   average_safety_score
0             49.504873

# Problem 7: List 5 community areas with highest % of households below poverty line.

In [68]:
pd.read_sql_query("SELECT community_area_number, community_area_name from census_data order by percent_households_below_poverty desc limit 5;",connection)

   COMMUNITY_AREA_NUMBER COMMUNITY_AREA_NAME
0                   54.0           Riverdale
1                   37.0         Fuller Park
2                   68.0           Englewood
3                   29.0      North Lawndale
4                   27.0  East Garfield Park

# Problem 8: Which community area(number) is most crime prone?

In [70]:
pd.read_sql_query("SELECT community_area_number,count(case_number) as no_of_cases from CHICAGO_CRIME_DATA group by community_area_number order by no_of_cases desc limit 1",connection)

   COMMUNITY_AREA_NUMBER  no_of_cases
0                   25.0           43

# Problem 9: Use a sub-query to find the name of the community area with highest hardship index.

In [71]:
pd.read_sql_query("SELECT COMMUNITY_AREA_NAME FROM  CENSUS_DATA WHERE HARDSHIP_INDEX = (SELECT MAX(HARDSHIP_INDEX) FROM CENSUS_DATA);",connection)

  COMMUNITY_AREA_NAME
0           Riverdale

# Problem 10: Use a sub-query to determine the Community Area Name with most number of crimes?

In [77]:
pd.read_sql_query("SELECT community_area_name FROM CENSUS_DATA WHERE COMMUNITY_AREA_NUMBER = (SELECT COMMUNITY_AREA_NUMBER FROM CHICAGO_CRIME_DATA GROUP BY COMMUNITY_AREA_NUMBER ORDER BY COUNT(COMMUNITY_AREA_NUMBER) DESC LIMIT 1) LIMIT 1;",connection)

  COMMUNITY_AREA_NAME
0              Austin